extends Node

const LINES := {
	"intro": "Добро пожаловать в наше выcококласное секретное учереждение!\nПомните, ВЫ- элита нашей струткры... А, вы охраник, тогда просто хорошего дня",
	"intro1": "Вам повезло, у нас не хвататет работников на такую грязную работу как настройка нашего гениального суперкомпьютера, поэтому вам крайне рекомендуется изучить *КРАСНУЮ* инструкцию",
	"intro2": "А теперь выдвигайтесь в архив и заберите инструкцию, он сразу за лифтом",
	"blue": "СИНИЯЯ? Где берут таких альтернативно одарённых?\n— Я сказал: КРАСНАЯ!",
	"storage": "Дверь заварена намертво, Какой хороший шов!\nПридется импровизировать(",
	"storage_door": "Тебе окрыты все двери этого бренного мира",
	"teleport": "Вы настолько тупой, что не знаете о том, что телепортации не существует! Это декорация для инвесторов!",
	}

func t(id: String) -> String:
	if LINES.has(id):
		return LINES[id]
	push_warning("Нет реплики: " + id)
	return "[" + id + "]"
